## Plans :thumbsup:
<details>
  <summary><h2>Terrateam Plan Output :thumbsup:</h2></summary>


**Dir**: .
**Workspace**: default
**Success**: :thumbsup:

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_cloudfunctions_function.my-cap-billing-function must be replaced
-/+ resource "google_cloudfunctions_function" "my-cap-billing-function" {
!       docker_registry               = "CONTAINER_REGISTRY" -> (known after apply)
!       entry_point                   = "stop_billing" -> "scale_down" # forces replacement
+       https_trigger_security_level  = (known after apply)
+       https_trigger_url             = (known after apply)
!       id                            = "projects/terrateam-362405/locations/us-central1/functions/cap-billing-f4fa157c45218076" -> (known after apply)
        name                          = "cap-billing-f4fa157c45218076"
+       vpc_connector_egress_settings = (known after apply)
        # (14 unchanged attributes hidden)

!       event_trigger {
!           resource   = "projects/terrateam-362405/topics/cap-billing-alert" -> "cap-billing-alert"
            # (1 unchanged attribute hidden)

            # (1 unchanged block hidden)
        }
    }

  # google_storage_bucket_object.my-cap-billing-archive must be replaced
-/+ resource "google_storage_bucket_object" "my-cap-billing-archive" {
!       content_type     = "application/zip" -> (known after apply)
!       crc32c           = "vGwV5A==" -> (known after apply)
!       detect_md5hash   = "XOHsqWa24gGkbo4mWc72fw==" -> "different hash" # forces replacement
-       event_based_hold = false -> null
!       id               = "cb9078f6-88df-1a37-c39e-fd1a8f2a2b23-f8f80bcfde2696431ddd23e9073218d3" -> (known after apply)
+       kms_key_name     = (known after apply)
!       md5hash          = "XOHsqWa24gGkbo4mWc72fw==" -> (known after apply)
!       media_link       = "https://storage.googleapis.com/download/storage/v1/b/cb9078f6-88df-1a37-c39e-fd1a8f2a2b23/o/f8f80bcfde2696431ddd23e9073218d3?generation=1663270336311253&alt=media" -> (known after apply)
-       metadata         = {} -> null
        name             = "f8f80bcfde2696431ddd23e9073218d3"
!       output_name      = "f8f80bcfde2696431ddd23e9073218d3" -> (known after apply)
!       self_link        = "https://www.googleapis.com/storage/v1/b/cb9078f6-88df-1a37-c39e-fd1a8f2a2b23/o/f8f80bcfde2696431ddd23e9073218d3" -> (known after apply)
!       storage_class    = "STANDARD" -> (known after apply)
-       temporary_hold   = false -> null
        # (2 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

```

<details>
  <summary>To apply this directory and workspace...</summary>

```
terrateam apply dir:. workspace:default
```

</details>


</details>

To apply all these changes, comment:

```
terrateam apply
```

## Cost Estimation
**Total Monthly Difference: 0.06 USD**
<details>
  <summary>Expand for cost estimation details</summary>

| Dir | Workspace | Previous (USD) | New (USD) | Diff (USD) |
| :---: | :---: | ---: | ---: | ---: |
| . | default | 0.00 | 0.06 | 0.06|
| | **Total** | **0.00** | **0.06** | **0.06** |
</details>

---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
